viys/Configuration/Keil5 MDK/stm32/Keil.LPC1700_DFP.2.0.0.pdsc
      <!-- *************************  Device 'LPC1788'  ***************************** -->
      <device Dname="LPC1788">
        <processor Dclock="120000000"/>
        <compile header="Device\Include\LPC177x_8x.h"  define="LPC177x_8x"/>
        <debug      svd="SVD\LPC178x7x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC178X_7X_UM.pdf"              title="LPC178x/7x User Manual"/>
        <book       name="Documents\LPC178X_7X.pdf"                 title="LPC178x Data Sheet"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCB1700" revision="Ver 1.3" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1700=ON">
      <description>Keil MCB1700 Development Board</description>
      <image small="Images\mcb1700_small.jpg" large="Images\mcb1700_large.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1700/" title="MCB1700 Evaluation Board Web Page"/>
      <book category="setup"     name="Documents\mcb1700_quickstart.pdf" title="MCB1700 Quick Start Guide"/>
      <book category="schematic" name="Documents\mcb1700-schematics.pdf" title="MCB1700 Schematics"/>
      <book category="manual"    name="Documents\mcb1700.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1758"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1768"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC175x"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC176x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="Proto"           n="4"              name="Prototyping areas connected to I/Os"/>
      <feature type="DIO"             n="70"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Host/OTG interface (USB Host connector)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="2"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="ConnOther"       n="1"              name="Speaker with amplifier"/>
      <feature type="Button"          n="2"              name="Push-Buttons: Reset, INT0 (external interrupt)"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <feature type="CustomFF"        n="120" m="120"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <conditions>

    <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC1700">
      <description>NXP LPC1700 Series devices</description>
      <require Dname="LPC17*"/>
    </condition>

    <condition id="LPC175x">
      <description>NXP LPC1750 Series devices</description>
      <require Dname="LPC175*"/>
    </condition>

    <condition id="LPC176x">
      <description>NXP LPC1760 Series devices</description>
      <require Dname="LPC176*"/>
    </condition>

    <condition id="LPC177x">
      <description>NXP LPC1770 Series devices</description>
      <require Dname="LPC177*"/>
    </condition>

    <condition id="LPC178x">
      <description>NXP LPC1780 Series devices</description>
      <require Dname="LPC178*"/>
    </condition>

    <condition id="LPC1700 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1700 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="LPC175*"/>
      <accept Dname="LPC176*"/>
    </condition>

    <condition id="LPC17xx CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1700 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="LPC17*"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN">
      <description>NXP LPC1700 CMSIS with PIN</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC1700 CMSIS GPIO">
      <description>NXP LPC1700 CMSIS with GPIO</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="GPIO"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO">
      <description>NXP LPC1700 CMSIS with PIN and GPIO</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO SPI">
      <description>NXP LPC1700 CMSIS with PIN, GPIO and SPI</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO SPI Display">
      <description>NXP LPC1700 CMSIS with PIN, GPIO, SPI and Display</description>
      <require condition="LPC1700 CMSIS PIN GPIO SPI"/>
      <require Cclass="Graphics" Cgroup="Display" Csub="MCBQVGA*" Cvariant="SPI IF"/>
    </condition>

