viys/Configuration/Keil5 MDK/stm32/Keil.LPC1700_DFP.2.0.0.pdsc
    <condition id="LPC1700 Ethernet">
      <description>NXP LPC1700 with Ethernet Controller</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1764"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1767"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
    </condition>

    <condition id="LPC1700 USBD">
      <description>NXP LPC1700 with USB Device Controller</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <accept Dname="LPC1751"/>
      <accept Dname="LPC1752"/>
      <accept Dname="LPC1754"/>
      <accept Dname="LPC1756"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1759"/>
      <accept Dname="LPC1764"/>
      <accept Dname="LPC1765"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
    </condition>
    
  </conditions>

  <examples>
    <!-- MCB1800 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Blinky">
      <description>Blinky example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="Blinky ULp" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Blinky_ULp">
      <description>Blinky ULINKpro example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB1700\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Demo" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Demo">
      <description>Demo example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
      </attributes>
    </example>
 
    <example name="emWin Example" doc="Abstract.txt" folder="Boards\Keil\MCB1700\emWin\Example">
      <description>emWin Graphics simple example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards\Keil\MCB1700\emWin\GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Middleware\USB\Device\HID" version="1.0.0">
      <description>USB Human Interface Device providing access from PC to board LEDs and joystick.</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Middleware\USB\Device\MassStorage" version="1.0.0">
      <description>USB Mass Storage Device using SD/MMC Memory Card as storage media</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Middleware\USB\Device\VirtualCOM" version="1.0.0">
      <description>Virtual COM Port example: bridges UART port of the eval board to a Virtual COM Port on the PC using the Communication Device Class (CDC) of USB Device</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>USB Device CDC</keyword>
        <keyword>Virtual COM Port</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="Boards\Keil\MCB1700\Middleware\USB\Host\MassStorage" version="1.0.0">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format storage device</description>
      <board name="MCB1700" vendor="Keil"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

