viys/Configuration/Keil5 MDK/stm32/Keil.LPC1700_DFP.2.0.0.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC17xx CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for NXP LPC1700 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_LPC17XX      /* Device Startup for NXP17XX */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- header files -->
        <file category="header" condition="LPC175x" name="Device\Include\LPC17xx.h"/>
        <file category="header" condition="LPC176x" name="Device\Include\LPC17xx.h"/>
        <file category="header" condition="LPC177x" name="Device\Include\LPC177x_8x.h"/>
        <file category="header" condition="LPC178x" name="Device\Include\LPC177x_8x.h"/>

        <!-- startup files -->
        <file category="source" condition="LPC175x" name="Device\Source\ARM\startup_LPC17xx.s"      attr="config"/>
        <file category="source" condition="LPC176x" name="Device\Source\ARM\startup_LPC17xx.s"      attr="config"/>
        <file category="source" condition="LPC177x" name="Device\Source\ARM\startup_LPC177x_8x.s"   attr="config"/>
        <file category="source" condition="LPC178x" name="Device\Source\ARM\startup_LPC177x_8x.s"   attr="config"/>

        <!-- system file -->
        <file category="source" condition="LPC175x" name="Device\Source\system_LPC17xx.c"           attr="config"/>
        <file category="source" condition="LPC176x" name="Device\Source\system_LPC17xx.c"           attr="config"/>
        <file category="source" condition="LPC177x" name="Device\Source\system_LPC177x_8x.c"        attr="config"/>
        <file category="source" condition="LPC178x" name="Device\Source\system_LPC177x_8x.c"        attr="config"/>

        <!-- device configuration required by drivers at the moment -->
        <file category="header" condition="LPC1700 CMSIS Device" name="RTE_Driver\Config\RTE_Device.h" attr="config"/>

      </files>
    </component>

    <component Cclass="Device" Cgroup="PIN" Cversion="1.00" condition="LPC1700 CMSIS Device">
      <description>Pin Connect driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver\PIN_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\PIN_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.00" condition="LPC1700 CMSIS Device">
      <description>GPIO driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPIO_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\GPIO_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.00" condition="LPC1700 CMSIS Device">
      <description>GPDMA driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPDMA_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\GPDMA_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.01" Cversion="2.00" condition="LPC1700 CMSIS PIN">
      <description>USB Device Driver for the LPC1700 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBD_LPC17xx.c"/>
        <file category="source" name="RTE_Driver\OTG_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.00" Cversion="2.00" condition="LPC1700 CMSIS PIN">
      <description>USB OHCI Host Driver for the LPC1700 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBH_LPC17xx.c"/>
        <file category="source" name="RTE_Driver\OTG_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.01" Cversion="2.01" condition="LPC1700 CMSIS PIN GPIO">
      <description>SPI Driver for LPC1700 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SSP_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02" Cversion="2.01" condition="LPC1700 CMSIS PIN">
      <description>I2C Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2C_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.01" Cversion="2.01" condition="LPC1700 CMSIS PIN">
      <description>UART Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART_LPC17xx.c"/>
      </files>
    </component>
