viys/Configuration/Keil5 MDK/stm32/Keil.LPC1700_DFP.2.0.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.01" Cversion="2.01" condition="LPC1700 Ethernet">
      <description>Ethernet MAC Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\EMAC_LPC17xx.c"/>
      </files>
    </component>

    <!-- MCB1700 Development Board -->
    <bundle Cbundle="MCB1700" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB1700</description>
      <doc>Documents\mcb1700.chm</doc>
      <component Cgroup="A/D Converter" condition="LPC1700 CMSIS PIN">
        <description>A/D Converter interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\ADC_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="LPC1700 CMSIS PIN GPIO">
      <description>LED driver for Keil MCB1700 Development Board</description>
        <files>
        <file category="source" name="Boards\Keil\MCB1700\Common\LED_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="LPC1700 CMSIS PIN GPIO">
        <description>Buttons interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\Buttons_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" condition="LPC1700 CMSIS PIN GPIO">
        <description>Joystick interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\Joystick_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" condition="LPC1700 CMSIS PIN GPIO SPI">
        <description>Graphic LCD interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCB1700\Common\GLCD_Config.h"/>
          <file category="source" name="Boards\Keil\MCB1700\Common\GLCD_Fonts.c"/>
          <file category="source" name="Boards\Keil\MCB1700\Common\GLCD_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="LPC1700 CMSIS PIN GPIO SPI Display">
        <description>emWin LCD SPI Interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\LCD_X.c"/>
        </files>
      </component>
    </bundle>

  </components>
</package>
